app/Http/Controllers/Dropdown/DropdownController.php

    public function getEmployee(Request $request)
    {
        try {
            $data = SchEmployee::UserEmployees();
            if ($request->branchId != "" && $request->branchId > 0)
                $data = SchEmployee::UserEmployees()->where('cmn_branch_id', $request->branchId);

            $data = $data->select(
                'id',
                'full_name as name'
            )->get();
---
select `id`, `full_name` as `name` from `sch_employees` where `cmn_branch_id` in (1)

    public function getUsers()
    {
        try {
            $data = User::where('is_sys_adm', 0)->select('id', 'username as name')->get();
---
select `id`, `username` as `name` from `users` where `is_sys_adm` = 0