app/Http/Repository/Language/LanguageRepository.php

    public function setLangaugeSession($langId)
    {
        Session::put("lang", CmnLanguage::where('id', $langId)->select('id', 'rtl', 'code')->first());
        $trans = CmnTranslation::select('lang_key', 'lang_value', 'cmn_language_id')->get();
---
select `id`, `rtl`, `code` from `cmn_languages` where `id` = 2 limit 1
select `lang_key`, `lang_value`, `cmn_language_id` from `cmn_translations`

    public function getLanguage()
    {
        $data = CmnLanguage::select('id', 'name')->orderByRaw('default_language desc')->get();
---
select `id`, `name` from `cmn_languages` order by default_language desc