app/Http/Controllers/Site/SiteController.php

select `id`, `name` from `sch_service_categories`
---
    public function getServiceCategory()
    {
        try {
            $data = SchServiceCategory::select(
                'id',
                'name'
            )->get();

select `id`, `name` from `cmn_branches`
---
    public function getBranch()
    {
        try {
            $data = CmnBranch::select(
                'id',
                'name'
            )->get();

select exists(select * from `sch_employee_offdays` where `sch_employee_id` = '4' and `start_date` <= '2024-03-29' and `end_date` >= '2024-03-29') as `exists`
select exists(select * from `sch_employee_schedules` where `sch_employee_id` = '4' and `day` = '5' and `is_off_day` = 1) as `exists`
select exists(select * from `cmn_business_holidays` where `cmn_branch_id` = '1' and `start_date` <= '2024-03-29' and `end_date` >= '2024-03-29') as `exists`
---
    public function getServiceTimeSlot(Request $request)
    {
        try {

            $bookingRepo = new BookingRepository();
            $day = (new Carbon($request->date))->format('w');
            $date = $request->date;

            //check employee holiday
            $employeeOffDay = SchEmployeeOffday::where('sch_employee_id', $request->sch_employee_id)
                ->where('start_date', '<=',  $date)->where('end_date', '>=',  $date)->exists();
            if ($employeeOffDay) {
                return $this->apiResponse(['status' => '5', 'data' => "Selected date is Staff Holiday/Leave"], 400);
            }

            //check employee holiday
            $employeeSchedule = $schedule = SchEmployeeSchedule::where('sch_employee_id', $request->sch_employee_id)
                ->where('day', $day)->where('is_off_day', 1)->exists();
            if ($employeeSchedule) {
                return $this->apiResponse(['status' => '5', 'data' => translate("Today is weekly holiday")], 400);
            }

            //check business holiday
            $businessHoliday = CmnBusinessHoliday::where('cmn_branch_id', $request->cmn_branch_id)
                ->where('start_date', '<=', $date)->where('end_date', '>=', $date)->exists();

select exists(select * from `cmn_business_hours` where `is_off_day` = 1 and `cmn_branch_id` = '1' and `day` = '5') as `exists`
---
            }

            //check weekly holiday
            $businessHours = CmnBusinessHour::where('is_off_day', 1)->where('cmn_branch_id', $request->cmn_branch_id)->where('day', $day)->exists();

select `start_time`, `end_time`, `break_start_time`, `break_end_time` from `sch_employee_schedules` where `sch_employee_id` = '4' and `day` = '5' limit 1
---
            }

            //get employee schedule
            $schedule = SchEmployeeSchedule::where('sch_employee_id', $request->sch_employee_id)
                ->where('day', $day)->select(
                    'start_time',
                    'end_time',
                    'break_start_time',
                    'break_end_time',
                )->first();

select `id`, `phone_no` from `cmn_customers` where `user_id` is null limit 1
---
    public function saveBooking(Request $request)
    {  //dd($request);

        Log::info($request->all());

        DB::beginTransaction();
         try {
            $request = (object)$request->bookingData;


            $bookingRepo = new BookingRepository();
            $customerId = 0;
            $customer = "";

            $customer = CmnCustomer::where('user_id', auth()->id())->select('id', 'phone_no')->first();



            //if login by user
            if (auth()->check()) {
                $customer = CmnCustomer::where('user_id', auth()->id())->select('id', 'phone_no')->first();

select `fees` from `sch_employee_services` where `sch_employee_id` = '4' and `sch_service_id` = '2' limit 1
---
            foreach ($request->items as $key => $item) {
                $item = (object)$item;
                //get employee wise service charge
                $serviceCharge = SchEmployeeService::where('sch_employee_id', $item->sch_employee_id)
                    ->where('sch_service_id', $item->sch_service_id)->select('fees')->first();