app/Http/Controllers/Site/WebsiteController.php

    public function getMenu()
    {
        $data = SiteMenu::where('status', 1)->select('id', 'name', 'site_menu_id', 'route', 'order')->orderBy('order')->get();
---
select `id`, `name`, `site_menu_id`, `route`, `order` from `site_menus` where `status` = 1 order by `order` asc

    public function getClientTestimonial()
    {
        $data =  SiteClientTestimonial::where('status', 1)->select('name', 'image', 'rating', 'description')->get();
---
select `name`, `image`, `rating`, `description` from `site_client_testimonials` where `status` = 1

    public function getNewJoiningEmployee()
    {
        $data = SchEmployee::leftJoin('hrm_departments', 'sch_employees.hrm_department_id', '=', 'hrm_departments.id')
            ->select('sch_employees.full_name', 'sch_employees.image_url', 'hrm_departments.name as department', 'sch_employees.specialist')
            ->orderBy('sch_employees.created_at')->limit(10)->get();
---
select `sch_employees`.`full_name`, `sch_employees`.`image_url`, `hrm_departments`.`name` as `department`, `sch_employees`.`specialist` from `sch_employees` left join `hrm_departments` on `sch_employees`.`hrm_department_id` = `hrm_departments`.`id` order by `sch_employees`.`created_at` asc limit 10