app/Http/Controllers/Site/WebsiteBookingControllerr.php

select `id` from `cmn_customers` where `user_id` = 40 limit 1
select * from `cmn_pets` where `id_dueno` = 43
---
    public function appoinmentBooking1(){
        $employees = $this->getEmployee();
        $userId = Auth::id();

        // Buscar el cliente con el user_id del usuario logueado
        $cliente = CmnCustomer::where('user_id', $userId)->value('id');


        // Cargar las mascotas del usuario logueado
        $pets = CmnPet::where('id_dueno', $cliente)->get();

select `sch_employees`.`id`, `sch_employees`.`user_id`, `sch_employees`.`image_url`, `sch_employees`.`employee_id`, `sch_employees`.`cmn_branch_id`, `sch_employees`.`full_name`, `sch_employees`.`email_address`, `sch_employees`.`country_code`, `sch_employees`.`contact_no`, `sch_employees`.`present_address`, `sch_employees`.`permanent_address`, `sch_employees`.`gender`, `sch_employees`.`dob`, `sch_employees`.`hrm_department_id`, `sch_employees`.`hrm_designation_id`, `sch_employees`.`specialist`, `sch_employees`.`note`, `sch_employees`.`status`, `cmn_branches`.`name` as `branch`, `sch_employees`.`salary`, `sch_employees`.`commission`, `sch_employees`.`pay_commission_based_on`, `sch_employees`.`target_service_amount`, `sch_employees`.`id_card`, `sch_employees`.`passport` from `sch_employees` inner join `cmn_branches` on `sch_employees`.`cmn_branch_id` = `cmn_branches`.`id` where `sch_employees`.`status` = 1
---
    public function getEmployee()
    {
        try {
            $data = SchEmployee::join('cmn_branches', 'sch_employees.cmn_branch_id', '=', 'cmn_branches.id')->select(
                'sch_employees.id',
                'sch_employees.user_id',
                'sch_employees.image_url',
                'sch_employees.employee_id',
                'sch_employees.cmn_branch_id',
                'sch_employees.full_name',
                'sch_employees.email_address',
                'sch_employees.country_code',
                'sch_employees.contact_no',
                'sch_employees.present_address',
                'sch_employees.permanent_address',
                'sch_employees.gender',
                'sch_employees.dob',
                'sch_employees.hrm_department_id',
                'sch_employees.hrm_designation_id',
                'sch_employees.specialist',
                'sch_employees.note',
                'sch_employees.status',
                'cmn_branches.name as branch',
                'sch_employees.salary',
                'sch_employees.commission',
                'sch_employees.pay_commission_based_on',
                'sch_employees.target_service_amount',
                'sch_employees.id_card',
                'sch_employees.passport'
            )
            ->where('sch_employees.status', '=', 1)
            ->get();