app/Http/Repository/Booking/BookingRepository.php

select `appoinntment_limit_type`, `appoinntment_limit`, `minimum_time_required_to_booking_in_days`, `minimum_time_required_to_booking_in_time`, `minimum_time_required_to_cancel_in_days`, `minimum_time_required_to_cancel_in_time` from `sch_services` where `id` = '2' limit 1
---
    public function IsServiceLimitation($serviceDate, $customerId, $serviceId, $checkServiceLimit, $checkBookingLimit)
    {
        $service = SchServices::where('id', $serviceId)
            ->select(
                'appoinntment_limit_type',
                'appoinntment_limit',
                'minimum_time_required_to_booking_in_days',
                'minimum_time_required_to_booking_in_time',
                'minimum_time_required_to_cancel_in_days',
                'minimum_time_required_to_cancel_in_time'
            )->first();

select sch_service_bookings.id,
sch_service_bookings.status,
cmn_customers.full_name as customer,
cmn_customers.phone_no as customer_phone_no,
sch_employees.full_name as employee,
cmn_branches.name as branch,
sch_services.title as service,
sch_service_bookings.date,
sch_service_bookings.start_time,
sch_service_bookings.end_time,
sch_service_bookings.remarks,
sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due from `sch_service_bookings` inner join `sch_services` on `sch_service_bookings`.`sch_service_id` = `sch_services`.`id` inner join `cmn_customers` on `sch_service_bookings`.`cmn_customer_id` = `cmn_customers`.`id` inner join `cmn_branches` on `sch_service_bookings`.`cmn_branch_id` = `cmn_branches`.`id` inner join `sch_employees` on `sch_service_bookings`.`sch_employee_id` = `sch_employees`.`id` where `sch_service_bookings`.`cmn_branch_id` in (1) and `date` >= '2024-02-29' and `date` <= '2024-04-30' order by sch_service_bookings.date desc, start_time desc
---
    public function getBookingInfo($dateFrom, $dateTo, $bookingId, $employeeId, $customerId, $serviceStatus)
    {
        $br = new Controller();
        $services =  SchServiceBooking::UserWiseServiceBooking()
            ->join('sch_services', 'sch_service_bookings.sch_service_id', '=', 'sch_services.id')
            ->join('cmn_customers', 'sch_service_bookings.cmn_customer_id', '=', 'cmn_customers.id')
            ->join('cmn_branches', 'sch_service_bookings.cmn_branch_id', '=', 'cmn_branches.id')
            ->join('sch_employees', 'sch_service_bookings.sch_employee_id', '=', 'sch_employees.id')
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'));
        if ($bookingId) {
            $services = $services->where('sch_service_bookings.id', $bookingId);
        } else {
            $services = $services->where('date', '>=', $dateFrom)->where('date', '<=', $dateTo);
            if ($employeeId)
                $services = $services->where('sch_service_bookings.sch_employee_id', $employeeId);
            if ($customerId)
                $services = $services->where('sch_service_bookings.cmn_customer_id', $customerId);
            if ($serviceStatus)
                $services = $services->where('sch_service_bookings.status', $serviceStatus);
        }

        $services = $services->selectRaw(
            'sch_service_bookings.id,
            sch_service_bookings.status,
            cmn_customers.full_name as customer,
            cmn_customers.phone_no as customer_phone_no,
            sch_employees.full_name as employee,
            cmn_branches.name as branch,
            sch_services.title as service,
            sch_service_bookings.date,
            sch_service_bookings.start_time,
            sch_service_bookings.end_time,
            sch_service_bookings.remarks,
            sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due'
        )->orderByRaw('sch_service_bookings.date desc, start_time desc')->get();

select `value` from `cmn_currency_setups` limit 1
select `sch_employees`.`id`, `sch_employees`.`full_name`, `sch_employee_services`.`fees` from `sch_employee_services` inner join `sch_employees` on `sch_employee_services`.`sch_employee_id` = `sch_employees`.`id` where `sch_employee_services`.`sch_service_id` = '2' and `sch_employees`.`cmn_branch_id` = '1' and `sch_employee_services`.`status` = 1 and `sch_employees`.`status` in (1)
---
    public function getEmployeeByService($serviceId, $branchId, $employeeStatus)
    {
        $currency = CmnCurrencySetup::select('value')->first();
        $data = SchEmployeeService::join('sch_employees', 'sch_employee_services.sch_employee_id', '=', 'sch_employees.id')
            ->where('sch_employee_services.sch_service_id', $serviceId)
            ->where('sch_employees.cmn_branch_id', $branchId)
            ->where('sch_employee_services.status', 1)
            ->whereIn('sch_employees.status', $employeeStatus)
            ->select(
                'sch_employees.id',
                'sch_employees.full_name',
                'sch_employee_services.fees'
            )->get();

select sch_service_bookings.id,
sch_service_bookings.status,
sch_employees.full_name as employee,
cmn_branches.name as branch,
sch_services.title as service,
sch_service_bookings.date,
sch_service_bookings.start_time,
sch_service_bookings.end_time,
sch_service_bookings.service_amount,
sch_service_bookings.paid_amount,
sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due from `sch_service_bookings` inner join `sch_services` on `sch_service_bookings`.`sch_service_id` = `sch_services`.`id` inner join `cmn_branches` on `sch_service_bookings`.`cmn_branch_id` = `cmn_branches`.`id` inner join `sch_employees` on `sch_service_bookings`.`sch_employee_id` = `sch_employees`.`id` where `sch_service_bookings`.`sch_service_booking_info_id` = 122 order by sch_service_bookings.date desc, start_time desc
---
    public function getServiceInvoice($orderId)
    {
        $orderInfo = SchServiceBookingInfo::join('cmn_customers', 'sch_service_booking_infos.cmn_customer_id', '=', 'cmn_customers.id')
            ->where('sch_service_booking_infos.id', $orderId)->select(
                'sch_service_booking_infos.id',
                'sch_service_booking_infos.booking_date',
                'sch_service_booking_infos.total_amount',
                'sch_service_booking_infos.paid_amount',
                'sch_service_booking_infos.due_amount',
                'sch_service_booking_infos.coupon_code',
                'sch_service_booking_infos.coupon_discount',
                'sch_service_booking_infos.remarks',
                'sch_service_booking_infos.payable_amount',
                'cmn_customers.full_name',
                'cmn_customers.phone_no',
                'cmn_customers.email',
                'cmn_customers.street_address',
                'cmn_customers.state',
                'cmn_customers.city',
                'cmn_customers.street_number',

            )->first();

        $orderDetails = SchServiceBooking::where('sch_service_bookings.sch_service_booking_info_id', $orderId)->join('sch_services', 'sch_service_bookings.sch_service_id', '=', 'sch_services.id')
            ->join('cmn_branches', 'sch_service_bookings.cmn_branch_id', '=', 'cmn_branches.id')
            ->join('sch_employees', 'sch_service_bookings.sch_employee_id', '=', 'sch_employees.id')
            ->selectRaw(
                'sch_service_bookings.id,
                sch_service_bookings.status,
                sch_employees.full_name as employee,
                cmn_branches.name as branch,
                sch_services.title as service,
                sch_service_bookings.date,
                sch_service_bookings.start_time,
                sch_service_bookings.end_time,
                sch_service_bookings.service_amount,
                sch_service_bookings.paid_amount,
                sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due'
            )->orderByRaw('sch_service_bookings.date desc, start_time desc')->get();