app/Http/Repository/Dashboard/DashboardRepository.php

    public function getBookingStatus()
    {
        $br = new Controller();
        $today = new Carbon();
        $totalBooking = SchServiceBooking::UserWiseServiceBooking()
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'))
            ->selectRaw(
                'sch_service_bookings.status as status,
                count(sch_service_bookings.status) as serviceCount'
            )->groupBy('sch_service_bookings.status')->get();
        $todayBooking = SchServiceBooking::UserWiseServiceBooking()
            ->where('sch_service_bookings.date', $today->toDateString())
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'))
            ->selectRaw(
                'sch_service_bookings.status as status,
                count(sch_service_bookings.status) as serviceCount'
            )->groupBy('sch_service_bookings.status')->get();
---
select sch_service_bookings.status as status,
count(sch_service_bookings.status) as serviceCount from `sch_service_bookings` where `sch_service_bookings`.`cmn_branch_id` in (1) group by `sch_service_bookings`.`status`
select sch_service_bookings.status as status,
count(sch_service_bookings.status) as serviceCount from `sch_service_bookings` where `sch_service_bookings`.`date` = '2024-03-30' and `sch_service_bookings`.`cmn_branch_id` in (1) group by `sch_service_bookings`.`status`

    public function getIncomeAndOtherStatistics()
    {
        $br = new Controller();
        $today = new Carbon();
        $todayPaidAndDue = SchServiceBooking::UserWiseServiceBooking()
            ->where('sch_service_bookings.date', $today->toDateString())
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'))
            ->selectRaw(
                'sch_service_bookings.payment_status,
            sum(sch_service_bookings.paid_amount) as paid_amount,
            sum(sch_service_bookings.service_amount) as service_amount'
            )->groupBy('sch_service_bookings.payment_status')->get();

        $todayPaidBy = SchServiceBooking::UserWiseServiceBooking()
            ->join('cmn_payment_types', 'sch_service_bookings.cmn_payment_type_id', '=', 'cmn_payment_types.id')
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'))
            ->where('sch_service_bookings.date', $today->toDateString())
            ->selectRaw(
                'cmn_payment_types.type,
            cmn_payment_types.name as PaymentBy,
            sum(sch_service_bookings.paid_amount) as paid_amount'
            )->groupBy('cmn_payment_types.name', 'cmn_payment_types.type')->get();
---
select sch_service_bookings.payment_status,
sum(sch_service_bookings.paid_amount) as paid_amount,
sum(sch_service_bookings.service_amount) as service_amount from `sch_service_bookings` where `sch_service_bookings`.`date` = '2024-03-30' and `sch_service_bookings`.`cmn_branch_id` in (1) group by `sch_service_bookings`.`payment_status`
select cmn_payment_types.type,
cmn_payment_types.name as PaymentBy,
sum(sch_service_bookings.paid_amount) as paid_amount from `sch_service_bookings` inner join `cmn_payment_types` on `sch_service_bookings`.`cmn_payment_type_id` = `cmn_payment_types`.`id` where `sch_service_bookings`.`cmn_branch_id` in (1) and `sch_service_bookings`.`date` = '2024-03-30' group by `cmn_payment_types`.`name`, `cmn_payment_types`.`type`

    public function getBookingInfo($serviceStatus, $duration)
    {
        $br = new Controller();
        $today = new Carbon();
        $services =  SchServiceBooking::UserWiseServiceBooking()
            ->join('sch_services', 'sch_service_bookings.sch_service_id', '=', 'sch_services.id')
            ->join('cmn_pets', 'sch_service_bookings.cmn_pet_id', '=', 'cmn_pets.id')
            ->join('cmn_customers', 'sch_service_bookings.cmn_customer_id', '=', 'cmn_customers.id')
            ->join('cmn_branches', 'sch_service_bookings.cmn_branch_id', '=', 'cmn_branches.id')
            ->join('sch_employees', 'sch_service_bookings.sch_employee_id', '=', 'sch_employees.id')
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'));
        if ($duration == 2) {
            $startDay = new Carbon();
            $startDay = $startDay->subDays(60);
            $services = $services->where('sch_service_bookings.date', '>=', $startDay->toDateString())
                ->where('sch_service_bookings.date', '<=', $today->toDateString());
        } else {
            $services = $services->where('sch_service_bookings.date', $today->toDateString());
        }

        if ($serviceStatus != null && $serviceStatus != "") {
            $services = $services->where('sch_service_bookings.status', '=', $serviceStatus);
        } else {
            $services = $services->where('sch_service_bookings.status', '!=', ServiceStatus::Atendido);
            $services = $services->where('sch_service_bookings.status', '!=', ServiceStatus::Cancel);

        }
        $services = $services->selectRaw(
            'sch_service_bookings.id,
            cmn_pets.id as pet_id,
            sch_service_bookings.status,
            cmn_pets.nombre,
            cmn_customers.full_name as customer,
            cmn_customers.phone_no as customer_phone_no,
            cmn_branches.name as branch,
            sch_employees.full_name as employee,
            sch_services.title as service,
            sch_service_bookings.date,
            sch_service_bookings.start_time,
            sch_service_bookings.remarks,
            sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due'
        )->orderByRaw('sch_service_bookings.date desc, start_time desc')->get();
---
select sch_service_bookings.id,
cmn_pets.id as pet_id,
sch_service_bookings.status,
cmn_pets.nombre,
cmn_customers.full_name as customer,
cmn_customers.phone_no as customer_phone_no,
cmn_branches.name as branch,
sch_employees.full_name as employee,
sch_services.title as service,
sch_service_bookings.date,
sch_service_bookings.start_time,
sch_service_bookings.remarks,
sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due from `sch_service_bookings` inner join `sch_services` on `sch_service_bookings`.`sch_service_id` = `sch_services`.`id` inner join `cmn_pets` on `sch_service_bookings`.`cmn_pet_id` = `cmn_pets`.`id` inner join `cmn_customers` on `sch_service_bookings`.`cmn_customer_id` = `cmn_customers`.`id` inner join `cmn_branches` on `sch_service_bookings`.`cmn_branch_id` = `cmn_branches`.`id` inner join `sch_employees` on `sch_service_bookings`.`sch_employee_id` = `sch_employees`.`id` where `sch_service_bookings`.`cmn_branch_id` in (1) and `sch_service_bookings`.`date` = '2024-03-30' and `sch_service_bookings`.`status` != 6 and `sch_service_bookings`.`status` != 3 order by sch_service_bookings.date desc, start_time desc

    public function getTopServices()
    {
        $br = new Controller();
        $data = SchServiceBooking::UserWiseServiceBooking()->join('sch_services', 'sch_service_bookings.sch_service_id', '=', 'sch_services.id')
            ->whereIn('sch_service_bookings.cmn_branch_id', $br->getUserBranch()->pluck('cmn_branch_id'))
            ->selectRaw('sch_service_id,sch_services.title,count(sch_service_bookings.sch_service_id) as service_count')
            ->groupBy('sch_service_id', 'sch_services.title')
            ->orderByRaw('service_count desc')->take(10)->get();
---
select sch_service_id,sch_services.title,count(sch_service_bookings.sch_service_id) as service_count from `sch_service_bookings` inner join `sch_services` on `sch_service_bookings`.`sch_service_id` = `sch_services`.`id` where `sch_service_bookings`.`cmn_branch_id` in (1) group by `sch_service_id`, `sch_services`.`title` order by service_count desc limit 10

    public function getCustomerWiseBookingStatus($userId)
    {
        $bookingStatus = SchServiceBooking::join('cmn_customers', 'sch_service_bookings.cmn_customer_id', '=', 'cmn_customers.id')
            ->where('cmn_customers.user_id', $userId)
            ->selectRaw(
                'sch_service_bookings.status as status,
                count(*) as serviceCount'
            )->groupBy('sch_service_bookings.status')->get();
---
select sch_service_bookings.status as status,
count(*) as serviceCount from `sch_service_bookings` inner join `cmn_customers` on `sch_service_bookings`.`cmn_customer_id` = `cmn_customers`.`id` where `cmn_customers`.`user_id` = 40 group by `sch_service_bookings`.`status`

    public function getLastBooking($numOfRecord, $userId)
    {
        $data =  SchServiceBooking::join('sch_services', 'sch_service_bookings.sch_service_id', '=', 'sch_services.id')
            ->join('sch_employees', 'sch_service_bookings.sch_employee_id', '=', 'sch_employees.id')
            ->join('cmn_customers', 'sch_service_bookings.cmn_customer_id', '=', 'cmn_customers.id')
            ->join('cmn_branches', 'sch_service_bookings.cmn_branch_id', '=', 'cmn_branches.id')
            ->where('cmn_customers.user_id', $userId)
            ->selectRaw(
                'sch_service_bookings.id,
                sch_service_bookings.status,
                sch_employees.full_name as employee,
                cmn_branches.name as branch,
                sch_services.title as service,
                sch_service_bookings.date,
                sch_service_bookings.start_time,
                sch_service_bookings.end_time,
                sch_service_bookings.remarks,
                sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due'
            )->orderBy('sch_service_bookings.date', 'desc')
            ->orderBy('sch_service_bookings.start_time', 'desc')->take($numOfRecord)->get();
---
select sch_service_bookings.id,
sch_service_bookings.status,
sch_employees.full_name as employee,
cmn_branches.name as branch,
sch_services.title as service,
sch_service_bookings.date,
sch_service_bookings.start_time,
sch_service_bookings.end_time,
sch_service_bookings.remarks,
sch_service_bookings.service_amount-sch_service_bookings.paid_amount as due from `sch_service_bookings` inner join `sch_services` on `sch_service_bookings`.`sch_service_id` = `sch_services`.`id` inner join `sch_employees` on `sch_service_bookings`.`sch_employee_id` = `sch_employees`.`id` inner join `cmn_customers` on `sch_service_bookings`.`cmn_customer_id` = `cmn_customers`.`id` inner join `cmn_branches` on `sch_service_bookings`.`cmn_branch_id` = `cmn_branches`.`id` where `cmn_customers`.`user_id` = 40 order by `sch_service_bookings`.`date` desc, `sch_service_bookings`.`start_time` desc limit 10

    public function getWebsiteServiceSummary()
    {
        return [
            'totalEmloyee' => SchEmployee::where('status', '!=', 3)->count(),
            'totalService' => SchServices::count(),
            'SatiffiedClient' => SchServiceBooking::selectRaw('count(*) as total')->groupBy('cmn_customer_id')->get()->count('total'),
            'DoneService' => SchServiceBooking::where('status', 4)->count()
        ];
---
select count(*) as aggregate from `sch_service_bookings` where `status` = 4
select count(*) as aggregate from `sch_employees` where `status` != 3
select count(*) as aggregate from `sch_services`
select count(*) as total from `sch_service_bookings` group by `cmn_customer_id`