app/Http/Repository/Settings/SettingsRepository.php

select `id`, `user_id`, `full_name`, `phone_no`, `email`, `dob`, `country`, `state`, `postal_code`, `city`, `street_address`, `street_number` from `cmn_customers` where `user_id` = 40 limit 1
---
    public function getCustomer($userId)
    {
        $data = CmnCustomer::where('user_id', $userId)
            ->select(
                'id',
                'user_id',
                'full_name',
                'phone_no',
                'email',
                'dob',
                'country',
                'state',
                'postal_code',
                'city',
                'street_address',
                'street_number',
            )->first();