app/Helper/helper.php

function translate($key, $langId = null)
{

    $langTranslate = Cache::get('langTranslate');

    if ($langId == null) {
        if (isset(Session::get('lang')['id'])) {
            $langId = Session::get('lang')['id'];
        }
        else{
            $engLangId = CmnLanguage::where('default_language', 1)->orWhere('code', 'en')->select('id')->first()->id;
            $langId = $engLangId;
        }
    }
    if ($langTranslate != array()) {

        if (!isset($langTranslate[$key . '_' . $langId])) {
            //if translate key & value not found in cache
            $trans = CmnTranslation::where('cmn_language_id', $langId)->where('lang_key', $key)->select('lang_value')->first();
            $engLangId = CmnLanguage::where('default_language', 1)->orWhere('code', 'en')->select('id')->first()->id;
---
select `lang_value` from `cmn_translations` where `cmn_language_id` = 2 and `lang_key` = 'Inicio' limit 1
select `id` from `cmn_languages` where `default_language` = 1 or `code` = 'en' limit 1