app/Http/Controllers/Controller.php

    public function getUserBranch()
    {
        $userBranch = SecUserBranch::where('user_id', Auth()->id())->select('cmn_branch_id')->get();
        if ($userBranch->count([0]) > 0) {
            return $userBranch;
        } else {
            return CmnBranch::select('id as cmn_branch_id')->get();
---
select `cmn_branch_id` from `sec_user_branches` where `user_id` = 1
select `id` as `cmn_branch_id` from `cmn_branches`