app/Http/Repository/Customer/CustomerRepository.php

    public function getCustomerDropDown(){
        return CmnCustomer::select('id','full_name as name','phone_no')->orderBy('id','DESC')->get();
---
select `id`, `full_name` as `name`, `phone_no` from `cmn_customers` order by `id` desc