app/Http/Controllers/Pet/PetController.php

        // Asumiendo que estás dentro de un método de un controlador

            // Obtener la mascota por su id con el dueño relacionado
            $pets = CmnPet::with('owner')->findOrFail($id);

            // Ahora $pet contiene la información de la mascota y $pet->owner contiene la información del dueño

            $ant = optional(CmAntecedente::where('id_pet', $id)->first());
            $examenes = CmExamenes::all();
---
select * from `cmn_pets` where `cmn_pets`.`id` = '155' limit 1
select * from `cm_antecedentes` where `id_pet` = '155' limit 1
select * from `cm_examenes`

    public function getpets()
    {
        // Obtiene todas las mascotas asociadas al id_dueno proporcionado
        // $pets = CmnPet::where('id_dueno', $id_dueno)->get();
        // $pets='Echolas';
        Log::info('Lllega ahsta la funcion');
        try {
            $data = CmnPet::all();
---
select * from `cmn_pets`