app/Http/Controllers/UserManagement/RolePermissionController.php

    public function getMenuList(){
        try{

            $menuLst =DB::table('sec_resource_permissions as rsp')
            ->join('sec_resources as rs','rsp.sec_resource_id','=','rs.id')
                              ->where('rsp.sec_role_id',DB::table('sec_user_roles')->where('sec_user_id',auth()->id())->first()->sec_role_id)
                              ->where('rsp.status', 1)
                              ->select('rs.id','rs.level', 'rs.serial','rsp.sec_resource_id', 'rs.method', 'rsp.display_name', 'rs.sec_resource_id as resource_id','rs.icon')
                              ->orderBy('rs.serial')->get();
---
select `rs`.`id`, `rs`.`level`, `rs`.`serial`, `rsp`.`sec_resource_id`, `rs`.`method`, `rsp`.`display_name`, `rs`.`sec_resource_id` as `resource_id`, `rs`.`icon` from `sec_resource_permissions` as `rsp` inner join `sec_resources` as `rs` on `rsp`.`sec_resource_id` = `rs`.`id` where `rsp`.`sec_role_id` = 1 and `rsp`.`status` = 1 order by `rs`.`serial` asc