app/Http/Controllers/Dashboard/DashboardController.php

    public function home()
    {

        $examenes = CmExamenes::all();
---
select * from `cm_examenes`