app/Http/Controllers/Booking/SchServiceBookingController.php

    public function checkEmail(Request $request)
    {
        $emailExists = CmnCustomer::where('email', $request->email)->exists();
---
select exists(select * from `cmn_customers` where `email` = '12@gmail.com2') as `exists`

    public function cambiarEstadoUltimaCita(Request $request, $idMascota)
{
    // Encontrar la última cita de la mascota
    $ultimaCita = SchServiceBooking::where('cmn_pet_id', $idMascota)
        ->orderBy('date', 'desc')
        ->first();

    // Verificar si se encontró alguna cita para la mascota
    if ($ultimaCita) {
        // Cambiar el estado de la última cita a 6
        $ultimaCita->status = 6;
        $ultimaCita->save();
---
select * from `sch_service_bookings` where `cmn_pet_id` = '139' order by `date` desc limit 1
update `sch_service_bookings` set `status` = 6, `sch_service_bookings`.`updated_at` = '2024-03-30 13:53:18' where `id` = 77